// Звісно, ось кілька завдань для тренування JavaScript:

// 1.Створіть функцію, яка приймає два числа і повертає їх суму.
// const calculateSum = (a, b) => a + b;

// console.log(calculateSum(2, 3));
// ======================================================================
// 2.Напишіть програму, яка перевіряє, чи є дане число парним або непарним.
// const checkEvenOdd = number => {
//   if (number % 2 === 0) {
//     console.log(`${number} - четное`);
//   } else {
//     console.log(`${number} - Не четное`);
//   }
// };

// checkEvenOdd(5);
// ========================================================================
// 3.Створіть масив строк і відсортуйте його в алфавітному порядку.
// const users = ['Roma', 'Ann', 'Kate', 'Ihor', 'andrey'];
// const inAlphabetOrder = [...users].sort((a, b) => a.localeCompare(b));

// console.log(users);
// console.log(inAlphabetOrder);
// ================================================================================
// 4.Напишіть функцію, яка приймає рядок і перевертає його (рядок "Hello" повинен
// стати "olleH").

// 5.Створіть об'єкт, що представляє користувача з ім'ям, віком та електронною адресою.
// Виведіть ці дані на консоль.

// 6.Напишіть програму, яка виводить всі прості числа від 1 до заданого користувачем числа.

// 7.Створіть масив чисел і знайдіть його середнє значення.

// 8.Напишіть функцію, яка приймає масив чисел і повертає новий масив,
// в якому всі числа збільшені на 1.

// 9.Створіть клас "Книга" з властивостями "назва", "автор" і "рік видання".
// Створіть об'єкт, представляючий книгу і виведіть його дані на консоль.

// 10.Напишіть програму, яка обчислює факторіал заданого числа.

// Звісно, ось кілька завдань для тренування використання колбек-функцій в JavaScript:

// Створіть функцію, яка приймає рядок і колбек-функцію для обробки цього рядка. Потім викличте колбек-функцію, передаючи їй цей рядок.

// Напишіть функцію, яка приймає масив чисел і колбек-функцію, яка обчислює суму цих чисел. Потім викличте колбек-функцію, передаючи їй суму.

// Створіть функцію, яка приймає два числа і колбек-функцію для обчислення їх добутку. Потім викличте колбек-функцію, передаючи їй добуток цих чисел.

// Напишіть функцію, яка приймає масив слів і колбек-функцію для обробки цих слів. Потім викличте колбек-функцію, передаючи їй перший елемент масиву.

// Створіть функцію, яка приймає об'єкт з ім'ям та віком і колбек-функцію для обробки цього об'єкта. Потім викличте колбек-функцію, передаючи їй об'єкт.
